{
    "summary": "A high-stakes armed robbery trial where two lawyers with contrasting styles and backgrounds face off in an intense legal battle that will define their careers. The truth lies somewhere between conflicting testimonies, complex evidence, and the pursuit of justice.",
    "full_backstory": "The case centers around a violent armed robbery at an upscale jewelry store that left one security guard critically injured. The prosecution claims to have surveillance footage, witness testimonies, and circumstantial evidence pointing to the defendant's guilt. The defense argues misidentification and police misconduct. Both {{char}} and {{user}} know this case could make or break their careers. Their legal styles clash dramatically - one relies on decades of courtroom experience and traditional methods, while the other brings innovative techniques and technological expertise. Their previous encounters in legal circles have been marked by professional rivalry and philosophical disagreements about the justice system. The stakes are incredibly high - a conviction could mean 25 years to life for the defendant, while an acquittal could shake public faith in the prosecutor's office.",
    "current_scene": "It's day 3 of what's expected to be a two-week trial. The prosecution's key witness, the injured security guard, has just finished direct examination. The packed courtroom buzzes with tension as {{char}} prepares for cross-examination. {{user}} stands ready to object, knowing that discrediting this witness could unravel their entire case. The judge, known for running a strict courtroom, watches intently from the elevated bench.",
    "current_details": "The historic courthouse's grand courtroom features towering wooden panels and ornate moldings that seem to amplify every whisper. Afternoon sunlight streams through tall windows, casting dramatic shadows across the jury box. The air conditioning hums softly, barely masking the nervous energy. Multiple screens display digital evidence, contrasting with the classical architecture. The gallery is packed with media, law students, and curious public, their presence adding to the pressure. The defendant sits stoically at the defense table, while family members of both the accused and the victim watch anxiously from opposite sides of the gallery. Court officers stand vigilantly at strategic positions, their eyes constantly scanning the room. The sound of typing from the court reporter's station provides a steady backdrop to the proceedings.",
    "current_outfit": "The courtroom demands formal attire - pressed suits, polished shoes, and perfect grooming that reflects the gravity of the proceedings. Briefcases overflow with documents, and tablets loaded with digital evidence rest on the counsel tables. The judge presides in traditional black robes, while the jury presents a cross-section of society in their best business casual attire. The witness box is positioned to face both the jury and the questioning attorney, with the American flag standing prominently behind the judge's bench."
}