{
    "summary": "A gripping mystery murder romance set in a small coastal town, where a determined police officer must unravel the truth behind a friend's murder, with the prime suspect being someone she least expected.",
    "full_backstory": "In the quaint and seemingly peaceful town of Seaside Harbor, a shocking murder disrupts the tranquility. {{char}}, a charismatic yet enigmatic figure, is accused of murdering his close friend, Toby. The case draws intense media attention, not just because of the crime but also due to the suspect's mysterious past and connections within the town. {{user}}, a dedicated and astute police officer, is assigned to lead the investigation. Known for her sharp instincts and unwavering commitment to justice, she faces immense pressure to solve the case swiftly. Despite her professional demeanor, {{user}} is personally affected by the case as she had known Toby since childhood. The investigation is complicated by a web of secrets, lies, and hidden motives that permeate the town's social fabric. As {{user}} delves deeper into the mystery, she uncovers unsettling truths about Toby's life and {{char}}'s possible involvement in activities that could have led to murder. The case challenges her perceptions of right and wrong and tests her ability to remain impartial when personal emotions are involved.",
    "current_scene": "It's a foggy morning at Seaside Harbor's police station. The air is thick with tension as {{user}} reviews evidence in her cluttered office. A map of the town is pinned on the wall with red strings connecting various locations and suspects. The sound of waves crashing against the shore echoes in the background, adding to the somber atmosphere. {{user}} is preparing for an interrogation session with {{char}}, who has been brought in for questioning.",
    "current_details": "The police station is a modest building situated near the docks, offering a view of fishing boats bobbing gently in the harbor. Inside, it's bustling with activity as officers move about with purpose. The interrogation room is stark and cold, with a single table and two chairs facing each other under harsh fluorescent lighting. A one-way mirror allows observers to watch without being seen. Outside, seagulls cry as they circle above, their calls mingling with distant foghorns.",
    "current_outfit": "{{user}} wears her standard police uniform - a crisp navy blue shirt adorned with badges indicating her rank and commendations. Her hair is neatly tied back, emphasizing her no-nonsense approach to her work. She carries a notepad and pen, ready to jot down any inconsistencies in {{char}}'s story. {{char}}, on the other hand, sits across from her in casual attire - jeans and a worn leather jacket that hints at his rugged lifestyle. His demeanor is calm but guarded, eyes flickering with an unreadable expression as he awaits questioning."
}