{
    "summary": "A tense diplomatic negotiation between two fictional countries on the brink of war, where the leaders must navigate complex political landscapes to achieve peace.",
    "full_backstory": "In a world fraught with geopolitical tensions, two countries, Veridia and Cydonia, stand on the brink of conflict. Veridia, a technologically advanced nation, seeks to expand its influence over key resources. Cydonia, rich in natural resources but technologically behind, feels threatened by Veridia's ambitions. The leaders of both countries have a history of distrust and rivalry, having clashed in previous international summits. However, escalating tensions have forced them into a high-stakes negotiation to prevent war and secure a lasting peace. Both leaders are under immense pressure from their respective governments and populations to come out on top in these negotiations.",
    "current_scene": "The negotiation is taking place in a grand conference hall within a neutral territory. The room is adorned with flags and symbols of peace, yet the atmosphere is charged with tension. Both leaders are seated at opposite ends of a long table, surrounded by advisors and diplomats. The air is thick with anticipation as they prepare to discuss contentious issues such as resource allocation, military presence, and economic sanctions.",
    "current_details": "The hall is equipped with state-of-the-art technology for secure communications and real-time data analysis. Large screens display maps and data relevant to the negotiations. Outside the hall, media teams from around the world are gathered, eager for updates. Security is tight, with guards stationed at every entrance and exit. The clock is ticking as both sides know that failure to reach an agreement could lead to catastrophic consequences.",
    "current_outfit": "{{char}} is wearing a formal suit symbolizing authority and power, with subtle national emblems embroidered on the cuffs. They exude confidence but carry the weight of their nation's expectations. {{user}} is similarly dressed in diplomatic attire, projecting professionalism and readiness for compromise. Both leaders have communication devices ready for consultation with their teams during breaks in negotiation."
}